RT-Thread/rt-thread/bsp/maxim/libraries/MAX32660PeriphDriver/CMSIS/Device/Maxim/MAX32660/Include/gcr_regs.h
/**@} end of group GCR_SCON_Register */

/**
 * @ingroup  gcr_registers
 * @defgroup GCR_RSTR0 GCR_RSTR0
 * @brief    Reset.
 * @{
 */
 #define MXC_F_GCR_RSTR0_DMA_POS                        0 /**< RSTR0_DMA Position */
 #define MXC_F_GCR_RSTR0_DMA                            ((uint32_t)(0x1UL << MXC_F_GCR_RSTR0_DMA_POS)) /**< RSTR0_DMA Mask */
 #define MXC_V_GCR_RSTR0_DMA_RFU                        ((uint32_t)0x0UL) /**< RSTR0_DMA_RFU Value */
 #define MXC_S_GCR_RSTR0_DMA_RFU                        (MXC_V_GCR_RSTR0_DMA_RFU << MXC_F_GCR_RSTR0_DMA_POS) /**< RSTR0_DMA_RFU Setting */
 #define MXC_V_GCR_RSTR0_DMA_RESET                      ((uint32_t)0x1UL) /**< RSTR0_DMA_RESET Value */
 #define MXC_S_GCR_RSTR0_DMA_RESET                      (MXC_V_GCR_RSTR0_DMA_RESET << MXC_F_GCR_RSTR0_DMA_POS) /**< RSTR0_DMA_RESET Setting */
 #define MXC_V_GCR_RSTR0_DMA_RESET_DONE                 ((uint32_t)0x0UL) /**< RSTR0_DMA_RESET_DONE Value */
 #define MXC_S_GCR_RSTR0_DMA_RESET_DONE                 (MXC_V_GCR_RSTR0_DMA_RESET_DONE << MXC_F_GCR_RSTR0_DMA_POS) /**< RSTR0_DMA_RESET_DONE Setting */
 #define MXC_V_GCR_RSTR0_DMA_BUSY                       ((uint32_t)0x1UL) /**< RSTR0_DMA_BUSY Value */
 #define MXC_S_GCR_RSTR0_DMA_BUSY                       (MXC_V_GCR_RSTR0_DMA_BUSY << MXC_F_GCR_RSTR0_DMA_POS) /**< RSTR0_DMA_BUSY Setting */

 #define MXC_F_GCR_RSTR0_WDT_POS                        1 /**< RSTR0_WDT Position */
 #define MXC_F_GCR_RSTR0_WDT                            ((uint32_t)(0x1UL << MXC_F_GCR_RSTR0_WDT_POS)) /**< RSTR0_WDT Mask */
 #define MXC_V_GCR_RSTR0_WDT_RFU                        ((uint32_t)0x0UL) /**< RSTR0_WDT_RFU Value */
 #define MXC_S_GCR_RSTR0_WDT_RFU                        (MXC_V_GCR_RSTR0_WDT_RFU << MXC_F_GCR_RSTR0_WDT_POS) /**< RSTR0_WDT_RFU Setting */
 #define MXC_V_GCR_RSTR0_WDT_RESET                      ((uint32_t)0x1UL) /**< RSTR0_WDT_RESET Value */
 #define MXC_S_GCR_RSTR0_WDT_RESET                      (MXC_V_GCR_RSTR0_WDT_RESET << MXC_F_GCR_RSTR0_WDT_POS) /**< RSTR0_WDT_RESET Setting */
 #define MXC_V_GCR_RSTR0_WDT_RESET_DONE                 ((uint32_t)0x0UL) /**< RSTR0_WDT_RESET_DONE Value */
 #define MXC_S_GCR_RSTR0_WDT_RESET_DONE                 (MXC_V_GCR_RSTR0_WDT_RESET_DONE << MXC_F_GCR_RSTR0_WDT_POS) /**< RSTR0_WDT_RESET_DONE Setting */
 #define MXC_V_GCR_RSTR0_WDT_BUSY                       ((uint32_t)0x1UL) /**< RSTR0_WDT_BUSY Value */
 #define MXC_S_GCR_RSTR0_WDT_BUSY                       (MXC_V_GCR_RSTR0_WDT_BUSY << MXC_F_GCR_RSTR0_WDT_POS) /**< RSTR0_WDT_BUSY Setting */

 #define MXC_F_GCR_RSTR0_GPIO0_POS                      2 /**< RSTR0_GPIO0 Position */
 #define MXC_F_GCR_RSTR0_GPIO0                          ((uint32_t)(0x1UL << MXC_F_GCR_RSTR0_GPIO0_POS)) /**< RSTR0_GPIO0 Mask */
 #define MXC_V_GCR_RSTR0_GPIO0_RFU                      ((uint32_t)0x0UL) /**< RSTR0_GPIO0_RFU Value */
 #define MXC_S_GCR_RSTR0_GPIO0_RFU                      (MXC_V_GCR_RSTR0_GPIO0_RFU << MXC_F_GCR_RSTR0_GPIO0_POS) /**< RSTR0_GPIO0_RFU Setting */
 #define MXC_V_GCR_RSTR0_GPIO0_RESET                    ((uint32_t)0x1UL) /**< RSTR0_GPIO0_RESET Value */
 #define MXC_S_GCR_RSTR0_GPIO0_RESET                    (MXC_V_GCR_RSTR0_GPIO0_RESET << MXC_F_GCR_RSTR0_GPIO0_POS) /**< RSTR0_GPIO0_RESET Setting */
 #define MXC_V_GCR_RSTR0_GPIO0_RESET_DONE               ((uint32_t)0x0UL) /**< RSTR0_GPIO0_RESET_DONE Value */
 #define MXC_S_GCR_RSTR0_GPIO0_RESET_DONE               (MXC_V_GCR_RSTR0_GPIO0_RESET_DONE << MXC_F_GCR_RSTR0_GPIO0_POS) /**< RSTR0_GPIO0_RESET_DONE Setting */
 #define MXC_V_GCR_RSTR0_GPIO0_BUSY                     ((uint32_t)0x1UL) /**< RSTR0_GPIO0_BUSY Value */
 #define MXC_S_GCR_RSTR0_GPIO0_BUSY                     (MXC_V_GCR_RSTR0_GPIO0_BUSY << MXC_F_GCR_RSTR0_GPIO0_POS) /**< RSTR0_GPIO0_BUSY Setting */

 #define MXC_F_GCR_RSTR0_TIMER0_POS                     5 /**< RSTR0_TIMER0 Position */
 #define MXC_F_GCR_RSTR0_TIMER0                         ((uint32_t)(0x1UL << MXC_F_GCR_RSTR0_TIMER0_POS)) /**< RSTR0_TIMER0 Mask */
 #define MXC_V_GCR_RSTR0_TIMER0_RFU                     ((uint32_t)0x0UL) /**< RSTR0_TIMER0_RFU Value */
 #define MXC_S_GCR_RSTR0_TIMER0_RFU                     (MXC_V_GCR_RSTR0_TIMER0_RFU << MXC_F_GCR_RSTR0_TIMER0_POS) /**< RSTR0_TIMER0_RFU Setting */
 #define MXC_V_GCR_RSTR0_TIMER0_RESET                   ((uint32_t)0x1UL) /**< RSTR0_TIMER0_RESET Value */
 #define MXC_S_GCR_RSTR0_TIMER0_RESET                   (MXC_V_GCR_RSTR0_TIMER0_RESET << MXC_F_GCR_RSTR0_TIMER0_POS) /**< RSTR0_TIMER0_RESET Setting */
 #define MXC_V_GCR_RSTR0_TIMER0_RESET_DONE              ((uint32_t)0x0UL) /**< RSTR0_TIMER0_RESET_DONE Value */
 #define MXC_S_GCR_RSTR0_TIMER0_RESET_DONE              (MXC_V_GCR_RSTR0_TIMER0_RESET_DONE << MXC_F_GCR_RSTR0_TIMER0_POS) /**< RSTR0_TIMER0_RESET_DONE Setting */
 #define MXC_V_GCR_RSTR0_TIMER0_BUSY                    ((uint32_t)0x1UL) /**< RSTR0_TIMER0_BUSY Value */
 #define MXC_S_GCR_RSTR0_TIMER0_BUSY                    (MXC_V_GCR_RSTR0_TIMER0_BUSY << MXC_F_GCR_RSTR0_TIMER0_POS) /**< RSTR0_TIMER0_BUSY Setting */

 #define MXC_F_GCR_RSTR0_TIMER1_POS                     6 /**< RSTR0_TIMER1 Position */
 #define MXC_F_GCR_RSTR0_TIMER1                         ((uint32_t)(0x1UL << MXC_F_GCR_RSTR0_TIMER1_POS)) /**< RSTR0_TIMER1 Mask */
 #define MXC_V_GCR_RSTR0_TIMER1_RFU                     ((uint32_t)0x0UL) /**< RSTR0_TIMER1_RFU Value */
 #define MXC_S_GCR_RSTR0_TIMER1_RFU                     (MXC_V_GCR_RSTR0_TIMER1_RFU << MXC_F_GCR_RSTR0_TIMER1_POS) /**< RSTR0_TIMER1_RFU Setting */
 #define MXC_V_GCR_RSTR0_TIMER1_RESET                   ((uint32_t)0x1UL) /**< RSTR0_TIMER1_RESET Value */
 #define MXC_S_GCR_RSTR0_TIMER1_RESET                   (MXC_V_GCR_RSTR0_TIMER1_RESET << MXC_F_GCR_RSTR0_TIMER1_POS) /**< RSTR0_TIMER1_RESET Setting */
 #define MXC_V_GCR_RSTR0_TIMER1_RESET_DONE              ((uint32_t)0x0UL) /**< RSTR0_TIMER1_RESET_DONE Value */
 #define MXC_S_GCR_RSTR0_TIMER1_RESET_DONE              (MXC_V_GCR_RSTR0_TIMER1_RESET_DONE << MXC_F_GCR_RSTR0_TIMER1_POS) /**< RSTR0_TIMER1_RESET_DONE Setting */
 #define MXC_V_GCR_RSTR0_TIMER1_BUSY                    ((uint32_t)0x1UL) /**< RSTR0_TIMER1_BUSY Value */
 #define MXC_S_GCR_RSTR0_TIMER1_BUSY                    (MXC_V_GCR_RSTR0_TIMER1_BUSY << MXC_F_GCR_RSTR0_TIMER1_POS) /**< RSTR0_TIMER1_BUSY Setting */

 #define MXC_F_GCR_RSTR0_TIMER2_POS                     7 /**< RSTR0_TIMER2 Position */
 #define MXC_F_GCR_RSTR0_TIMER2                         ((uint32_t)(0x1UL << MXC_F_GCR_RSTR0_TIMER2_POS)) /**< RSTR0_TIMER2 Mask */
 #define MXC_V_GCR_RSTR0_TIMER2_RFU                     ((uint32_t)0x0UL) /**< RSTR0_TIMER2_RFU Value */
 #define MXC_S_GCR_RSTR0_TIMER2_RFU                     (MXC_V_GCR_RSTR0_TIMER2_RFU << MXC_F_GCR_RSTR0_TIMER2_POS) /**< RSTR0_TIMER2_RFU Setting */
 #define MXC_V_GCR_RSTR0_TIMER2_RESET                   ((uint32_t)0x1UL) /**< RSTR0_TIMER2_RESET Value */
 #define MXC_S_GCR_RSTR0_TIMER2_RESET                   (MXC_V_GCR_RSTR0_TIMER2_RESET << MXC_F_GCR_RSTR0_TIMER2_POS) /**< RSTR0_TIMER2_RESET Setting */
 #define MXC_V_GCR_RSTR0_TIMER2_RESET_DONE              ((uint32_t)0x0UL) /**< RSTR0_TIMER2_RESET_DONE Value */
 #define MXC_S_GCR_RSTR0_TIMER2_RESET_DONE              (MXC_V_GCR_RSTR0_TIMER2_RESET_DONE << MXC_F_GCR_RSTR0_TIMER2_POS) /**< RSTR0_TIMER2_RESET_DONE Setting */
 #define MXC_V_GCR_RSTR0_TIMER2_BUSY                    ((uint32_t)0x1UL) /**< RSTR0_TIMER2_BUSY Value */
 #define MXC_S_GCR_RSTR0_TIMER2_BUSY                    (MXC_V_GCR_RSTR0_TIMER2_BUSY << MXC_F_GCR_RSTR0_TIMER2_POS) /**< RSTR0_TIMER2_BUSY Setting */

