RT-Thread/rt-thread/bsp/maxim/libraries/MAX32660PeriphDriver/CMSIS/Device/Maxim/MAX32660/Include/gcr_regs.h
 #define MXC_F_GCR_RSTR0_UART0_POS                      11 /**< RSTR0_UART0 Position */
 #define MXC_F_GCR_RSTR0_UART0                          ((uint32_t)(0x1UL << MXC_F_GCR_RSTR0_UART0_POS)) /**< RSTR0_UART0 Mask */
 #define MXC_V_GCR_RSTR0_UART0_RFU                      ((uint32_t)0x0UL) /**< RSTR0_UART0_RFU Value */
 #define MXC_S_GCR_RSTR0_UART0_RFU                      (MXC_V_GCR_RSTR0_UART0_RFU << MXC_F_GCR_RSTR0_UART0_POS) /**< RSTR0_UART0_RFU Setting */
 #define MXC_V_GCR_RSTR0_UART0_RESET                    ((uint32_t)0x1UL) /**< RSTR0_UART0_RESET Value */
 #define MXC_S_GCR_RSTR0_UART0_RESET                    (MXC_V_GCR_RSTR0_UART0_RESET << MXC_F_GCR_RSTR0_UART0_POS) /**< RSTR0_UART0_RESET Setting */
 #define MXC_V_GCR_RSTR0_UART0_RESET_DONE               ((uint32_t)0x0UL) /**< RSTR0_UART0_RESET_DONE Value */
 #define MXC_S_GCR_RSTR0_UART0_RESET_DONE               (MXC_V_GCR_RSTR0_UART0_RESET_DONE << MXC_F_GCR_RSTR0_UART0_POS) /**< RSTR0_UART0_RESET_DONE Setting */
 #define MXC_V_GCR_RSTR0_UART0_BUSY                     ((uint32_t)0x1UL) /**< RSTR0_UART0_BUSY Value */
 #define MXC_S_GCR_RSTR0_UART0_BUSY                     (MXC_V_GCR_RSTR0_UART0_BUSY << MXC_F_GCR_RSTR0_UART0_POS) /**< RSTR0_UART0_BUSY Setting */

 #define MXC_F_GCR_RSTR0_UART1_POS                      12 /**< RSTR0_UART1 Position */
 #define MXC_F_GCR_RSTR0_UART1                          ((uint32_t)(0x1UL << MXC_F_GCR_RSTR0_UART1_POS)) /**< RSTR0_UART1 Mask */
 #define MXC_V_GCR_RSTR0_UART1_RFU                      ((uint32_t)0x0UL) /**< RSTR0_UART1_RFU Value */
 #define MXC_S_GCR_RSTR0_UART1_RFU                      (MXC_V_GCR_RSTR0_UART1_RFU << MXC_F_GCR_RSTR0_UART1_POS) /**< RSTR0_UART1_RFU Setting */
 #define MXC_V_GCR_RSTR0_UART1_RESET                    ((uint32_t)0x1UL) /**< RSTR0_UART1_RESET Value */
 #define MXC_S_GCR_RSTR0_UART1_RESET                    (MXC_V_GCR_RSTR0_UART1_RESET << MXC_F_GCR_RSTR0_UART1_POS) /**< RSTR0_UART1_RESET Setting */
 #define MXC_V_GCR_RSTR0_UART1_RESET_DONE               ((uint32_t)0x0UL) /**< RSTR0_UART1_RESET_DONE Value */
 #define MXC_S_GCR_RSTR0_UART1_RESET_DONE               (MXC_V_GCR_RSTR0_UART1_RESET_DONE << MXC_F_GCR_RSTR0_UART1_POS) /**< RSTR0_UART1_RESET_DONE Setting */
 #define MXC_V_GCR_RSTR0_UART1_BUSY                     ((uint32_t)0x1UL) /**< RSTR0_UART1_BUSY Value */
 #define MXC_S_GCR_RSTR0_UART1_BUSY                     (MXC_V_GCR_RSTR0_UART1_BUSY << MXC_F_GCR_RSTR0_UART1_POS) /**< RSTR0_UART1_BUSY Setting */

 #define MXC_F_GCR_RSTR0_SPI0_POS                       13 /**< RSTR0_SPI0 Position */
 #define MXC_F_GCR_RSTR0_SPI0                           ((uint32_t)(0x1UL << MXC_F_GCR_RSTR0_SPI0_POS)) /**< RSTR0_SPI0 Mask */
 #define MXC_V_GCR_RSTR0_SPI0_RFU                       ((uint32_t)0x0UL) /**< RSTR0_SPI0_RFU Value */
 #define MXC_S_GCR_RSTR0_SPI0_RFU                       (MXC_V_GCR_RSTR0_SPI0_RFU << MXC_F_GCR_RSTR0_SPI0_POS) /**< RSTR0_SPI0_RFU Setting */
 #define MXC_V_GCR_RSTR0_SPI0_RESET                     ((uint32_t)0x1UL) /**< RSTR0_SPI0_RESET Value */
 #define MXC_S_GCR_RSTR0_SPI0_RESET                     (MXC_V_GCR_RSTR0_SPI0_RESET << MXC_F_GCR_RSTR0_SPI0_POS) /**< RSTR0_SPI0_RESET Setting */
 #define MXC_V_GCR_RSTR0_SPI0_RESET_DONE                ((uint32_t)0x0UL) /**< RSTR0_SPI0_RESET_DONE Value */
 #define MXC_S_GCR_RSTR0_SPI0_RESET_DONE                (MXC_V_GCR_RSTR0_SPI0_RESET_DONE << MXC_F_GCR_RSTR0_SPI0_POS) /**< RSTR0_SPI0_RESET_DONE Setting */
 #define MXC_V_GCR_RSTR0_SPI0_BUSY                      ((uint32_t)0x1UL) /**< RSTR0_SPI0_BUSY Value */
 #define MXC_S_GCR_RSTR0_SPI0_BUSY                      (MXC_V_GCR_RSTR0_SPI0_BUSY << MXC_F_GCR_RSTR0_SPI0_POS) /**< RSTR0_SPI0_BUSY Setting */

 #define MXC_F_GCR_RSTR0_SPI1_POS                       14 /**< RSTR0_SPI1 Position */
 #define MXC_F_GCR_RSTR0_SPI1                           ((uint32_t)(0x1UL << MXC_F_GCR_RSTR0_SPI1_POS)) /**< RSTR0_SPI1 Mask */
 #define MXC_V_GCR_RSTR0_SPI1_RFU                       ((uint32_t)0x0UL) /**< RSTR0_SPI1_RFU Value */
 #define MXC_S_GCR_RSTR0_SPI1_RFU                       (MXC_V_GCR_RSTR0_SPI1_RFU << MXC_F_GCR_RSTR0_SPI1_POS) /**< RSTR0_SPI1_RFU Setting */
 #define MXC_V_GCR_RSTR0_SPI1_RESET                     ((uint32_t)0x1UL) /**< RSTR0_SPI1_RESET Value */
 #define MXC_S_GCR_RSTR0_SPI1_RESET                     (MXC_V_GCR_RSTR0_SPI1_RESET << MXC_F_GCR_RSTR0_SPI1_POS) /**< RSTR0_SPI1_RESET Setting */
 #define MXC_V_GCR_RSTR0_SPI1_RESET_DONE                ((uint32_t)0x0UL) /**< RSTR0_SPI1_RESET_DONE Value */
 #define MXC_S_GCR_RSTR0_SPI1_RESET_DONE                (MXC_V_GCR_RSTR0_SPI1_RESET_DONE << MXC_F_GCR_RSTR0_SPI1_POS) /**< RSTR0_SPI1_RESET_DONE Setting */
 #define MXC_V_GCR_RSTR0_SPI1_BUSY                      ((uint32_t)0x1UL) /**< RSTR0_SPI1_BUSY Value */
 #define MXC_S_GCR_RSTR0_SPI1_BUSY                      (MXC_V_GCR_RSTR0_SPI1_BUSY << MXC_F_GCR_RSTR0_SPI1_POS) /**< RSTR0_SPI1_BUSY Setting */

 #define MXC_F_GCR_RSTR0_I2C0_POS                       16 /**< RSTR0_I2C0 Position */
 #define MXC_F_GCR_RSTR0_I2C0                           ((uint32_t)(0x1UL << MXC_F_GCR_RSTR0_I2C0_POS)) /**< RSTR0_I2C0 Mask */
 #define MXC_V_GCR_RSTR0_I2C0_RFU                       ((uint32_t)0x0UL) /**< RSTR0_I2C0_RFU Value */
 #define MXC_S_GCR_RSTR0_I2C0_RFU                       (MXC_V_GCR_RSTR0_I2C0_RFU << MXC_F_GCR_RSTR0_I2C0_POS) /**< RSTR0_I2C0_RFU Setting */
 #define MXC_V_GCR_RSTR0_I2C0_RESET                     ((uint32_t)0x1UL) /**< RSTR0_I2C0_RESET Value */
 #define MXC_S_GCR_RSTR0_I2C0_RESET                     (MXC_V_GCR_RSTR0_I2C0_RESET << MXC_F_GCR_RSTR0_I2C0_POS) /**< RSTR0_I2C0_RESET Setting */
 #define MXC_V_GCR_RSTR0_I2C0_RESET_DONE                ((uint32_t)0x0UL) /**< RSTR0_I2C0_RESET_DONE Value */
 #define MXC_S_GCR_RSTR0_I2C0_RESET_DONE                (MXC_V_GCR_RSTR0_I2C0_RESET_DONE << MXC_F_GCR_RSTR0_I2C0_POS) /**< RSTR0_I2C0_RESET_DONE Setting */
 #define MXC_V_GCR_RSTR0_I2C0_BUSY                      ((uint32_t)0x1UL) /**< RSTR0_I2C0_BUSY Value */
 #define MXC_S_GCR_RSTR0_I2C0_BUSY                      (MXC_V_GCR_RSTR0_I2C0_BUSY << MXC_F_GCR_RSTR0_I2C0_POS) /**< RSTR0_I2C0_BUSY Setting */

 #define MXC_F_GCR_RSTR0_RTC_POS                        17 /**< RSTR0_RTC Position */
 #define MXC_F_GCR_RSTR0_RTC                            ((uint32_t)(0x1UL << MXC_F_GCR_RSTR0_RTC_POS)) /**< RSTR0_RTC Mask */
 #define MXC_V_GCR_RSTR0_RTC_RFU                        ((uint32_t)0x0UL) /**< RSTR0_RTC_RFU Value */
 #define MXC_S_GCR_RSTR0_RTC_RFU                        (MXC_V_GCR_RSTR0_RTC_RFU << MXC_F_GCR_RSTR0_RTC_POS) /**< RSTR0_RTC_RFU Setting */
 #define MXC_V_GCR_RSTR0_RTC_RESET                      ((uint32_t)0x1UL) /**< RSTR0_RTC_RESET Value */
 #define MXC_S_GCR_RSTR0_RTC_RESET                      (MXC_V_GCR_RSTR0_RTC_RESET << MXC_F_GCR_RSTR0_RTC_POS) /**< RSTR0_RTC_RESET Setting */
 #define MXC_V_GCR_RSTR0_RTC_RESET_DONE                 ((uint32_t)0x0UL) /**< RSTR0_RTC_RESET_DONE Value */
 #define MXC_S_GCR_RSTR0_RTC_RESET_DONE                 (MXC_V_GCR_RSTR0_RTC_RESET_DONE << MXC_F_GCR_RSTR0_RTC_POS) /**< RSTR0_RTC_RESET_DONE Setting */
 #define MXC_V_GCR_RSTR0_RTC_BUSY                       ((uint32_t)0x1UL) /**< RSTR0_RTC_BUSY Value */
 #define MXC_S_GCR_RSTR0_RTC_BUSY                       (MXC_V_GCR_RSTR0_RTC_BUSY << MXC_F_GCR_RSTR0_RTC_POS) /**< RSTR0_RTC_BUSY Setting */

 #define MXC_F_GCR_RSTR0_SRST_POS                       29 /**< RSTR0_SRST Position */
 #define MXC_F_GCR_RSTR0_SRST                           ((uint32_t)(0x1UL << MXC_F_GCR_RSTR0_SRST_POS)) /**< RSTR0_SRST Mask */
 #define MXC_V_GCR_RSTR0_SRST_RFU                       ((uint32_t)0x0UL) /**< RSTR0_SRST_RFU Value */
 #define MXC_S_GCR_RSTR0_SRST_RFU                       (MXC_V_GCR_RSTR0_SRST_RFU << MXC_F_GCR_RSTR0_SRST_POS) /**< RSTR0_SRST_RFU Setting */
 #define MXC_V_GCR_RSTR0_SRST_RESET                     ((uint32_t)0x1UL) /**< RSTR0_SRST_RESET Value */
 #define MXC_S_GCR_RSTR0_SRST_RESET                     (MXC_V_GCR_RSTR0_SRST_RESET << MXC_F_GCR_RSTR0_SRST_POS) /**< RSTR0_SRST_RESET Setting */
 #define MXC_V_GCR_RSTR0_SRST_RESET_DONE                ((uint32_t)0x0UL) /**< RSTR0_SRST_RESET_DONE Value */
 #define MXC_S_GCR_RSTR0_SRST_RESET_DONE                (MXC_V_GCR_RSTR0_SRST_RESET_DONE << MXC_F_GCR_RSTR0_SRST_POS) /**< RSTR0_SRST_RESET_DONE Setting */
 #define MXC_V_GCR_RSTR0_SRST_BUSY                      ((uint32_t)0x1UL) /**< RSTR0_SRST_BUSY Value */
 #define MXC_S_GCR_RSTR0_SRST_BUSY                      (MXC_V_GCR_RSTR0_SRST_BUSY << MXC_F_GCR_RSTR0_SRST_POS) /**< RSTR0_SRST_BUSY Setting */

 #define MXC_F_GCR_RSTR0_PRST_POS                       30 /**< RSTR0_PRST Position */
 #define MXC_F_GCR_RSTR0_PRST                           ((uint32_t)(0x1UL << MXC_F_GCR_RSTR0_PRST_POS)) /**< RSTR0_PRST Mask */
 #define MXC_V_GCR_RSTR0_PRST_RFU                       ((uint32_t)0x0UL) /**< RSTR0_PRST_RFU Value */
 #define MXC_S_GCR_RSTR0_PRST_RFU                       (MXC_V_GCR_RSTR0_PRST_RFU << MXC_F_GCR_RSTR0_PRST_POS) /**< RSTR0_PRST_RFU Setting */
 #define MXC_V_GCR_RSTR0_PRST_RESET                     ((uint32_t)0x1UL) /**< RSTR0_PRST_RESET Value */
 #define MXC_S_GCR_RSTR0_PRST_RESET                     (MXC_V_GCR_RSTR0_PRST_RESET << MXC_F_GCR_RSTR0_PRST_POS) /**< RSTR0_PRST_RESET Setting */
 #define MXC_V_GCR_RSTR0_PRST_RESET_DONE                ((uint32_t)0x0UL) /**< RSTR0_PRST_RESET_DONE Value */
 #define MXC_S_GCR_RSTR0_PRST_RESET_DONE                (MXC_V_GCR_RSTR0_PRST_RESET_DONE << MXC_F_GCR_RSTR0_PRST_POS) /**< RSTR0_PRST_RESET_DONE Setting */
 #define MXC_V_GCR_RSTR0_PRST_BUSY                      ((uint32_t)0x1UL) /**< RSTR0_PRST_BUSY Value */
 #define MXC_S_GCR_RSTR0_PRST_BUSY                      (MXC_V_GCR_RSTR0_PRST_BUSY << MXC_F_GCR_RSTR0_PRST_POS) /**< RSTR0_PRST_BUSY Setting */

