RT-Thread/rt-thread/bsp/maxim/libraries/MAX32660PeriphDriver/CMSIS/Device/Maxim/MAX32660/Include/gcr_regs.h
 #define MXC_F_GCR_PERCKCN0_DMAD_POS                    5 /**< PERCKCN0_DMAD Position */
 #define MXC_F_GCR_PERCKCN0_DMAD                        ((uint32_t)(0x1UL << MXC_F_GCR_PERCKCN0_DMAD_POS)) /**< PERCKCN0_DMAD Mask */
 #define MXC_V_GCR_PERCKCN0_DMAD_EN                     ((uint32_t)0x0UL) /**< PERCKCN0_DMAD_EN Value */
 #define MXC_S_GCR_PERCKCN0_DMAD_EN                     (MXC_V_GCR_PERCKCN0_DMAD_EN << MXC_F_GCR_PERCKCN0_DMAD_POS) /**< PERCKCN0_DMAD_EN Setting */
 #define MXC_V_GCR_PERCKCN0_DMAD_DIS                    ((uint32_t)0x1UL) /**< PERCKCN0_DMAD_DIS Value */
 #define MXC_S_GCR_PERCKCN0_DMAD_DIS                    (MXC_V_GCR_PERCKCN0_DMAD_DIS << MXC_F_GCR_PERCKCN0_DMAD_POS) /**< PERCKCN0_DMAD_DIS Setting */

 #define MXC_F_GCR_PERCKCN0_SPI0D_POS                   6 /**< PERCKCN0_SPI0D Position */
 #define MXC_F_GCR_PERCKCN0_SPI0D                       ((uint32_t)(0x1UL << MXC_F_GCR_PERCKCN0_SPI0D_POS)) /**< PERCKCN0_SPI0D Mask */
 #define MXC_V_GCR_PERCKCN0_SPI0D_EN                    ((uint32_t)0x0UL) /**< PERCKCN0_SPI0D_EN Value */
 #define MXC_S_GCR_PERCKCN0_SPI0D_EN                    (MXC_V_GCR_PERCKCN0_SPI0D_EN << MXC_F_GCR_PERCKCN0_SPI0D_POS) /**< PERCKCN0_SPI0D_EN Setting */
 #define MXC_V_GCR_PERCKCN0_SPI0D_DIS                   ((uint32_t)0x1UL) /**< PERCKCN0_SPI0D_DIS Value */
 #define MXC_S_GCR_PERCKCN0_SPI0D_DIS                   (MXC_V_GCR_PERCKCN0_SPI0D_DIS << MXC_F_GCR_PERCKCN0_SPI0D_POS) /**< PERCKCN0_SPI0D_DIS Setting */

 #define MXC_F_GCR_PERCKCN0_SPI1D_POS                   7 /**< PERCKCN0_SPI1D Position */
 #define MXC_F_GCR_PERCKCN0_SPI1D                       ((uint32_t)(0x1UL << MXC_F_GCR_PERCKCN0_SPI1D_POS)) /**< PERCKCN0_SPI1D Mask */
 #define MXC_V_GCR_PERCKCN0_SPI1D_EN                    ((uint32_t)0x0UL) /**< PERCKCN0_SPI1D_EN Value */
 #define MXC_S_GCR_PERCKCN0_SPI1D_EN                    (MXC_V_GCR_PERCKCN0_SPI1D_EN << MXC_F_GCR_PERCKCN0_SPI1D_POS) /**< PERCKCN0_SPI1D_EN Setting */
 #define MXC_V_GCR_PERCKCN0_SPI1D_DIS                   ((uint32_t)0x1UL) /**< PERCKCN0_SPI1D_DIS Value */
 #define MXC_S_GCR_PERCKCN0_SPI1D_DIS                   (MXC_V_GCR_PERCKCN0_SPI1D_DIS << MXC_F_GCR_PERCKCN0_SPI1D_POS) /**< PERCKCN0_SPI1D_DIS Setting */

 #define MXC_F_GCR_PERCKCN0_UART0D_POS                  9 /**< PERCKCN0_UART0D Position */
 #define MXC_F_GCR_PERCKCN0_UART0D                      ((uint32_t)(0x1UL << MXC_F_GCR_PERCKCN0_UART0D_POS)) /**< PERCKCN0_UART0D Mask */
 #define MXC_V_GCR_PERCKCN0_UART0D_EN                   ((uint32_t)0x0UL) /**< PERCKCN0_UART0D_EN Value */
 #define MXC_S_GCR_PERCKCN0_UART0D_EN                   (MXC_V_GCR_PERCKCN0_UART0D_EN << MXC_F_GCR_PERCKCN0_UART0D_POS) /**< PERCKCN0_UART0D_EN Setting */
 #define MXC_V_GCR_PERCKCN0_UART0D_DIS                  ((uint32_t)0x1UL) /**< PERCKCN0_UART0D_DIS Value */
 #define MXC_S_GCR_PERCKCN0_UART0D_DIS                  (MXC_V_GCR_PERCKCN0_UART0D_DIS << MXC_F_GCR_PERCKCN0_UART0D_POS) /**< PERCKCN0_UART0D_DIS Setting */

 #define MXC_F_GCR_PERCKCN0_UART1D_POS                  10 /**< PERCKCN0_UART1D Position */
 #define MXC_F_GCR_PERCKCN0_UART1D                      ((uint32_t)(0x1UL << MXC_F_GCR_PERCKCN0_UART1D_POS)) /**< PERCKCN0_UART1D Mask */
 #define MXC_V_GCR_PERCKCN0_UART1D_EN                   ((uint32_t)0x0UL) /**< PERCKCN0_UART1D_EN Value */
 #define MXC_S_GCR_PERCKCN0_UART1D_EN                   (MXC_V_GCR_PERCKCN0_UART1D_EN << MXC_F_GCR_PERCKCN0_UART1D_POS) /**< PERCKCN0_UART1D_EN Setting */
 #define MXC_V_GCR_PERCKCN0_UART1D_DIS                  ((uint32_t)0x1UL) /**< PERCKCN0_UART1D_DIS Value */
 #define MXC_S_GCR_PERCKCN0_UART1D_DIS                  (MXC_V_GCR_PERCKCN0_UART1D_DIS << MXC_F_GCR_PERCKCN0_UART1D_POS) /**< PERCKCN0_UART1D_DIS Setting */

 #define MXC_F_GCR_PERCKCN0_I2C0D_POS                   13 /**< PERCKCN0_I2C0D Position */
 #define MXC_F_GCR_PERCKCN0_I2C0D                       ((uint32_t)(0x1UL << MXC_F_GCR_PERCKCN0_I2C0D_POS)) /**< PERCKCN0_I2C0D Mask */
 #define MXC_V_GCR_PERCKCN0_I2C0D_EN                    ((uint32_t)0x0UL) /**< PERCKCN0_I2C0D_EN Value */
 #define MXC_S_GCR_PERCKCN0_I2C0D_EN                    (MXC_V_GCR_PERCKCN0_I2C0D_EN << MXC_F_GCR_PERCKCN0_I2C0D_POS) /**< PERCKCN0_I2C0D_EN Setting */
 #define MXC_V_GCR_PERCKCN0_I2C0D_DIS                   ((uint32_t)0x1UL) /**< PERCKCN0_I2C0D_DIS Value */
 #define MXC_S_GCR_PERCKCN0_I2C0D_DIS                   (MXC_V_GCR_PERCKCN0_I2C0D_DIS << MXC_F_GCR_PERCKCN0_I2C0D_POS) /**< PERCKCN0_I2C0D_DIS Setting */

 #define MXC_F_GCR_PERCKCN0_T0D_POS                     15 /**< PERCKCN0_T0D Position */
 #define MXC_F_GCR_PERCKCN0_T0D                         ((uint32_t)(0x1UL << MXC_F_GCR_PERCKCN0_T0D_POS)) /**< PERCKCN0_T0D Mask */
 #define MXC_V_GCR_PERCKCN0_T0D_EN                      ((uint32_t)0x0UL) /**< PERCKCN0_T0D_EN Value */
 #define MXC_S_GCR_PERCKCN0_T0D_EN                      (MXC_V_GCR_PERCKCN0_T0D_EN << MXC_F_GCR_PERCKCN0_T0D_POS) /**< PERCKCN0_T0D_EN Setting */
 #define MXC_V_GCR_PERCKCN0_T0D_DIS                     ((uint32_t)0x1UL) /**< PERCKCN0_T0D_DIS Value */
 #define MXC_S_GCR_PERCKCN0_T0D_DIS                     (MXC_V_GCR_PERCKCN0_T0D_DIS << MXC_F_GCR_PERCKCN0_T0D_POS) /**< PERCKCN0_T0D_DIS Setting */

 #define MXC_F_GCR_PERCKCN0_T1D_POS                     16 /**< PERCKCN0_T1D Position */
 #define MXC_F_GCR_PERCKCN0_T1D                         ((uint32_t)(0x1UL << MXC_F_GCR_PERCKCN0_T1D_POS)) /**< PERCKCN0_T1D Mask */
 #define MXC_V_GCR_PERCKCN0_T1D_EN                      ((uint32_t)0x0UL) /**< PERCKCN0_T1D_EN Value */
 #define MXC_S_GCR_PERCKCN0_T1D_EN                      (MXC_V_GCR_PERCKCN0_T1D_EN << MXC_F_GCR_PERCKCN0_T1D_POS) /**< PERCKCN0_T1D_EN Setting */
 #define MXC_V_GCR_PERCKCN0_T1D_DIS                     ((uint32_t)0x1UL) /**< PERCKCN0_T1D_DIS Value */
 #define MXC_S_GCR_PERCKCN0_T1D_DIS                     (MXC_V_GCR_PERCKCN0_T1D_DIS << MXC_F_GCR_PERCKCN0_T1D_POS) /**< PERCKCN0_T1D_DIS Setting */

 #define MXC_F_GCR_PERCKCN0_T2D_POS                     17 /**< PERCKCN0_T2D Position */
 #define MXC_F_GCR_PERCKCN0_T2D                         ((uint32_t)(0x1UL << MXC_F_GCR_PERCKCN0_T2D_POS)) /**< PERCKCN0_T2D Mask */
 #define MXC_V_GCR_PERCKCN0_T2D_EN                      ((uint32_t)0x0UL) /**< PERCKCN0_T2D_EN Value */
 #define MXC_S_GCR_PERCKCN0_T2D_EN                      (MXC_V_GCR_PERCKCN0_T2D_EN << MXC_F_GCR_PERCKCN0_T2D_POS) /**< PERCKCN0_T2D_EN Setting */
 #define MXC_V_GCR_PERCKCN0_T2D_DIS                     ((uint32_t)0x1UL) /**< PERCKCN0_T2D_DIS Value */
 #define MXC_S_GCR_PERCKCN0_T2D_DIS                     (MXC_V_GCR_PERCKCN0_T2D_DIS << MXC_F_GCR_PERCKCN0_T2D_POS) /**< PERCKCN0_T2D_DIS Setting */

 #define MXC_F_GCR_PERCKCN0_I2C1D_POS                   28 /**< PERCKCN0_I2C1D Position */
 #define MXC_F_GCR_PERCKCN0_I2C1D                       ((uint32_t)(0x1UL << MXC_F_GCR_PERCKCN0_I2C1D_POS)) /**< PERCKCN0_I2C1D Mask */
 #define MXC_V_GCR_PERCKCN0_I2C1D_EN                    ((uint32_t)0x0UL) /**< PERCKCN0_I2C1D_EN Value */
 #define MXC_S_GCR_PERCKCN0_I2C1D_EN                    (MXC_V_GCR_PERCKCN0_I2C1D_EN << MXC_F_GCR_PERCKCN0_I2C1D_POS) /**< PERCKCN0_I2C1D_EN Setting */
 #define MXC_V_GCR_PERCKCN0_I2C1D_DIS                   ((uint32_t)0x1UL) /**< PERCKCN0_I2C1D_DIS Value */
 #define MXC_S_GCR_PERCKCN0_I2C1D_DIS                   (MXC_V_GCR_PERCKCN0_I2C1D_DIS << MXC_F_GCR_PERCKCN0_I2C1D_POS) /**< PERCKCN0_I2C1D_DIS Setting */

/**@} end of group GCR_PERCKCN0_Register */

/**
 * @ingroup  gcr_registers
 * @defgroup GCR_MEMCKCN GCR_MEMCKCN
 * @brief    Memory Clock Control Register.
 * @{
 */
 #define MXC_F_GCR_MEMCKCN_FWS_POS                      0 /**< MEMCKCN_FWS Position */
 #define MXC_F_GCR_MEMCKCN_FWS                          ((uint32_t)(0x7UL << MXC_F_GCR_MEMCKCN_FWS_POS)) /**< MEMCKCN_FWS Mask */

