RT-Thread/rt-thread/bsp/maxim/libraries/MAX32660PeriphDriver/CMSIS/Device/Maxim/MAX32660/Include/gcr_regs.h
 #define MXC_F_GCR_SYSST_CODEINTERR_POS                 1 /**< SYSST_CODEINTERR Position */
 #define MXC_F_GCR_SYSST_CODEINTERR                     ((uint32_t)(0x1UL << MXC_F_GCR_SYSST_CODEINTERR_POS)) /**< SYSST_CODEINTERR Mask */
 #define MXC_V_GCR_SYSST_CODEINTERR_NORM                ((uint32_t)0x0UL) /**< SYSST_CODEINTERR_NORM Value */
 #define MXC_S_GCR_SYSST_CODEINTERR_NORM                (MXC_V_GCR_SYSST_CODEINTERR_NORM << MXC_F_GCR_SYSST_CODEINTERR_POS) /**< SYSST_CODEINTERR_NORM Setting */
 #define MXC_V_GCR_SYSST_CODEINTERR_CODE                ((uint32_t)0x1UL) /**< SYSST_CODEINTERR_CODE Value */
 #define MXC_S_GCR_SYSST_CODEINTERR_CODE                (MXC_V_GCR_SYSST_CODEINTERR_CODE << MXC_F_GCR_SYSST_CODEINTERR_POS) /**< SYSST_CODEINTERR_CODE Setting */

 #define MXC_F_GCR_SYSST_SCMEMF_POS                     5 /**< SYSST_SCMEMF Position */
 #define MXC_F_GCR_SYSST_SCMEMF                         ((uint32_t)(0x1UL << MXC_F_GCR_SYSST_SCMEMF_POS)) /**< SYSST_SCMEMF Mask */
 #define MXC_V_GCR_SYSST_SCMEMF_NORM                    ((uint32_t)0x0UL) /**< SYSST_SCMEMF_NORM Value */
 #define MXC_S_GCR_SYSST_SCMEMF_NORM                    (MXC_V_GCR_SYSST_SCMEMF_NORM << MXC_F_GCR_SYSST_SCMEMF_POS) /**< SYSST_SCMEMF_NORM Setting */
 #define MXC_V_GCR_SYSST_SCMEMF_MEMORY                  ((uint32_t)0x1UL) /**< SYSST_SCMEMF_MEMORY Value */
 #define MXC_S_GCR_SYSST_SCMEMF_MEMORY                  (MXC_V_GCR_SYSST_SCMEMF_MEMORY << MXC_F_GCR_SYSST_SCMEMF_POS) /**< SYSST_SCMEMF_MEMORY Setting */

/**@} end of group GCR_SYSST_Register */

/**
 * @ingroup  gcr_registers
 * @defgroup GCR_RSTR1 GCR_RSTR1
 * @brief    Reset 1.
 * @{
 */
 #define MXC_F_GCR_RSTR1_I2C1_POS                       0 /**< RSTR1_I2C1 Position */
 #define MXC_F_GCR_RSTR1_I2C1                           ((uint32_t)(0x1UL << MXC_F_GCR_RSTR1_I2C1_POS)) /**< RSTR1_I2C1 Mask */
 #define MXC_V_GCR_RSTR1_I2C1_RFU                       ((uint32_t)0x0UL) /**< RSTR1_I2C1_RFU Value */
 #define MXC_S_GCR_RSTR1_I2C1_RFU                       (MXC_V_GCR_RSTR1_I2C1_RFU << MXC_F_GCR_RSTR1_I2C1_POS) /**< RSTR1_I2C1_RFU Setting */
 #define MXC_V_GCR_RSTR1_I2C1_RESET                     ((uint32_t)0x1UL) /**< RSTR1_I2C1_RESET Value */
 #define MXC_S_GCR_RSTR1_I2C1_RESET                     (MXC_V_GCR_RSTR1_I2C1_RESET << MXC_F_GCR_RSTR1_I2C1_POS) /**< RSTR1_I2C1_RESET Setting */
 #define MXC_V_GCR_RSTR1_I2C1_RESET_DONE                ((uint32_t)0x0UL) /**< RSTR1_I2C1_RESET_DONE Value */
 #define MXC_S_GCR_RSTR1_I2C1_RESET_DONE                (MXC_V_GCR_RSTR1_I2C1_RESET_DONE << MXC_F_GCR_RSTR1_I2C1_POS) /**< RSTR1_I2C1_RESET_DONE Setting */
 #define MXC_V_GCR_RSTR1_I2C1_BUSY                      ((uint32_t)0x1UL) /**< RSTR1_I2C1_BUSY Value */
 #define MXC_S_GCR_RSTR1_I2C1_BUSY                      (MXC_V_GCR_RSTR1_I2C1_BUSY << MXC_F_GCR_RSTR1_I2C1_POS) /**< RSTR1_I2C1_BUSY Setting */

/**@} end of group GCR_RSTR1_Register */

/**
 * @ingroup  gcr_registers
 * @defgroup GCR_PERCKCN1 GCR_PERCKCN1
 * @brief    Peripheral Clock Disable.
 * @{
 */
 #define MXC_F_GCR_PERCKCN1_FLCD_POS                    3 /**< PERCKCN1_FLCD Position */
 #define MXC_F_GCR_PERCKCN1_FLCD                        ((uint32_t)(0x1UL << MXC_F_GCR_PERCKCN1_FLCD_POS)) /**< PERCKCN1_FLCD Mask */
 #define MXC_V_GCR_PERCKCN1_FLCD_EN                     ((uint32_t)0x0UL) /**< PERCKCN1_FLCD_EN Value */
 #define MXC_S_GCR_PERCKCN1_FLCD_EN                     (MXC_V_GCR_PERCKCN1_FLCD_EN << MXC_F_GCR_PERCKCN1_FLCD_POS) /**< PERCKCN1_FLCD_EN Setting */
 #define MXC_V_GCR_PERCKCN1_FLCD_DIS                    ((uint32_t)0x1UL) /**< PERCKCN1_FLCD_DIS Value */
 #define MXC_S_GCR_PERCKCN1_FLCD_DIS                    (MXC_V_GCR_PERCKCN1_FLCD_DIS << MXC_F_GCR_PERCKCN1_FLCD_POS) /**< PERCKCN1_FLCD_DIS Setting */

 #define MXC_F_GCR_PERCKCN1_ICACHED_POS                 11 /**< PERCKCN1_ICACHED Position */
 #define MXC_F_GCR_PERCKCN1_ICACHED                     ((uint32_t)(0x1UL << MXC_F_GCR_PERCKCN1_ICACHED_POS)) /**< PERCKCN1_ICACHED Mask */
 #define MXC_V_GCR_PERCKCN1_ICACHED_EN                  ((uint32_t)0x0UL) /**< PERCKCN1_ICACHED_EN Value */
 #define MXC_S_GCR_PERCKCN1_ICACHED_EN                  (MXC_V_GCR_PERCKCN1_ICACHED_EN << MXC_F_GCR_PERCKCN1_ICACHED_POS) /**< PERCKCN1_ICACHED_EN Setting */
 #define MXC_V_GCR_PERCKCN1_ICACHED_DIS                 ((uint32_t)0x1UL) /**< PERCKCN1_ICACHED_DIS Value */
 #define MXC_S_GCR_PERCKCN1_ICACHED_DIS                 (MXC_V_GCR_PERCKCN1_ICACHED_DIS << MXC_F_GCR_PERCKCN1_ICACHED_POS) /**< PERCKCN1_ICACHED_DIS Setting */

/**@} end of group GCR_PERCKCN1_Register */

/**
 * @ingroup  gcr_registers
 * @defgroup GCR_EVTEN GCR_EVTEN
 * @brief    Event Enable Register.
 * @{
 */
 #define MXC_F_GCR_EVTEN_DMAEVENT_POS                   0 /**< EVTEN_DMAEVENT Position */
 #define MXC_F_GCR_EVTEN_DMAEVENT                       ((uint32_t)(0x1UL << MXC_F_GCR_EVTEN_DMAEVENT_POS)) /**< EVTEN_DMAEVENT Mask */

 #define MXC_F_GCR_EVTEN_RXEVENT_POS                    1 /**< EVTEN_RXEVENT Position */
 #define MXC_F_GCR_EVTEN_RXEVENT                        ((uint32_t)(0x1UL << MXC_F_GCR_EVTEN_RXEVENT_POS)) /**< EVTEN_RXEVENT Mask */

/**@} end of group GCR_EVTEN_Register */

/**
 * @ingroup  gcr_registers
 * @defgroup GCR_REVISION GCR_REVISION
 * @brief    Revision Register.
 * @{
 */
 #define MXC_F_GCR_REVISION_REVISION_POS                0 /**< REVISION_REVISION Position */
 #define MXC_F_GCR_REVISION_REVISION                    ((uint32_t)(0xFFFFUL << MXC_F_GCR_REVISION_REVISION_POS)) /**< REVISION_REVISION Mask */

/**@} end of group GCR_REVISION_Register */

/**
 * @ingroup  gcr_registers
 * @defgroup GCR_SYSSIE GCR_SYSSIE
 * @brief    System Status Interrupt Enable Register.
 * @{
 */
 #define MXC_F_GCR_SYSSIE_ICEULIE_POS                   0 /**< SYSSIE_ICEULIE Position */
 #define MXC_F_GCR_SYSSIE_ICEULIE                       ((uint32_t)(0x1UL << MXC_F_GCR_SYSSIE_ICEULIE_POS)) /**< SYSSIE_ICEULIE Mask */
 #define MXC_V_GCR_SYSSIE_ICEULIE_DIS                   ((uint32_t)0x0UL) /**< SYSSIE_ICEULIE_DIS Value */
 #define MXC_S_GCR_SYSSIE_ICEULIE_DIS                   (MXC_V_GCR_SYSSIE_ICEULIE_DIS << MXC_F_GCR_SYSSIE_ICEULIE_POS) /**< SYSSIE_ICEULIE_DIS Setting */
 #define MXC_V_GCR_SYSSIE_ICEULIE_EN                    ((uint32_t)0x1UL) /**< SYSSIE_ICEULIE_EN Value */
 #define MXC_S_GCR_SYSSIE_ICEULIE_EN                    (MXC_V_GCR_SYSSIE_ICEULIE_EN << MXC_F_GCR_SYSSIE_ICEULIE_POS) /**< SYSSIE_ICEULIE_EN Setting */

 #define MXC_F_GCR_SYSSIE_CIEIE_POS                     1 /**< SYSSIE_CIEIE Position */
 #define MXC_F_GCR_SYSSIE_CIEIE                         ((uint32_t)(0x1UL << MXC_F_GCR_SYSSIE_CIEIE_POS)) /**< SYSSIE_CIEIE Mask */
 #define MXC_V_GCR_SYSSIE_CIEIE_DIS                     ((uint32_t)0x0UL) /**< SYSSIE_CIEIE_DIS Value */
 #define MXC_S_GCR_SYSSIE_CIEIE_DIS                     (MXC_V_GCR_SYSSIE_CIEIE_DIS << MXC_F_GCR_SYSSIE_CIEIE_POS) /**< SYSSIE_CIEIE_DIS Setting */
 #define MXC_V_GCR_SYSSIE_CIEIE_EN                      ((uint32_t)0x1UL) /**< SYSSIE_CIEIE_EN Value */
 #define MXC_S_GCR_SYSSIE_CIEIE_EN                      (MXC_V_GCR_SYSSIE_CIEIE_EN << MXC_F_GCR_SYSSIE_CIEIE_POS) /**< SYSSIE_CIEIE_EN Setting */

 #define MXC_F_GCR_SYSSIE_SCMFIE_POS                    5 /**< SYSSIE_SCMFIE Position */
 #define MXC_F_GCR_SYSSIE_SCMFIE                        ((uint32_t)(0x1UL << MXC_F_GCR_SYSSIE_SCMFIE_POS)) /**< SYSSIE_SCMFIE Mask */
 #define MXC_V_GCR_SYSSIE_SCMFIE_DIS                    ((uint32_t)0x0UL) /**< SYSSIE_SCMFIE_DIS Value */
 #define MXC_S_GCR_SYSSIE_SCMFIE_DIS                    (MXC_V_GCR_SYSSIE_SCMFIE_DIS << MXC_F_GCR_SYSSIE_SCMFIE_POS) /**< SYSSIE_SCMFIE_DIS Setting */
 #define MXC_V_GCR_SYSSIE_SCMFIE_EN                     ((uint32_t)0x1UL) /**< SYSSIE_SCMFIE_EN Value */
 #define MXC_S_GCR_SYSSIE_SCMFIE_EN                     (MXC_V_GCR_SYSSIE_SCMFIE_EN << MXC_F_GCR_SYSSIE_SCMFIE_POS) /**< SYSSIE_SCMFIE_EN Setting */

/**@} end of group GCR_SYSSIE_Register */

#ifdef __cplusplus
}
#endif

#endif /* _GCR_REGS_H_ */
